Repository: Abdallah-Hassan-Ahmed/AXON
Catalog: flutter/lib/l10n/*.arb
Languages: ar

source: En
ar: انجليزى

source: AR
ar: عربى

# englis
source: English
ar: انجليزى

source: Arabic
ar: عربى

# app_name
source: Axon
ar: أكسون

source: Skip
ar: تخطي

# onboarding_title_1
source: Connect with the best Doctors
ar: تواصل مع أفضل الأطباء

# onboarding_desc_1
source: Find a doctor in any specialty and book an appointment easily from home
ar: اعثر على طبيب في أي تخصص واحجز موعدك بسهولة من المنزل

source: Next
ar: التالي

# onboarding_title_2
source: Online Medical Consultations
ar: استشارات طبية عبر الإنترنت

# onboarding_desc_2
source: Video sessions with the doctor while you are in your place, with an electronic prescription
ar: جلسات فيديو مع الطبيب وأنت في مكانك، مع وصفة طبية إلكترونية

# onboarding_title_3
source: Track Your Health Smartly
ar: تابع صحتك بذكاء

# onboarding_desc_3
source: Complete medical history, medication reminders, and follow-up with your doctor
ar: سجل طبي كامل، تذكير بالأدوية، ومتابعة مع طبيبك

source: Get Started
ar: ابدأ الآن

source: Email
ar: البريد الإلكتروني

# enter_email
source: Enter your email
ar: أدخل بريدك الإلكتروني

source: Password
ar: كلمة المرور

# enter_password
source: Enter your password
ar: أدخل كلمة المرور

source: Forgot Password?
ar: هل نسيت كلمة المرور؟

source: Sign In
ar: تسجيل الدخول

# dont_have_account
source: Don’t have an account?
ar: ليس لديك حساب؟

source: Sign Up
ar: إنشاء حساب

source: OR
ar: أو

# sign_in_google
source: Sign in with Google
ar: تسجيل الدخول باستخدام Google

source: Full Name
ar: الاسم الكامل

# enter_full_name
source: Enter your full name
ar: أدخل اسمك الكامل

source: Phone Number
ar: رقم الهاتف

# enter_phone
source: Enter your phone number
ar: أدخل رقم هاتفك

source: Gender
ar: النوع

source: Male
ar: ذكر

source: Female
ar: أنثى

source: Radiology images
ar: صور الأشعة

# no_radiology
source: No radiology images added yet
ar: لا توجد صور أشعة بعد

source: Scan type
ar: نوع الفحص

# no_lab_tests
source: No lab tests added yet
ar: لا توجد تحاليل بعد

source: Test name
ar: اسم التحليل

source: Condition name
ar: اسم الحالة

source: Allergy name
ar: اسم الحساسية

# no_allergies
source: No allergies added yet
ar: لا توجد حساسية مضافة بعد

source: Years
ar: سنة

source: Edit Basic Information
ar: تعديل البيانات الأساسية

source: Comments
ar: التعليقات

# write_comment
source: Write a comment...
ar: اكتب تعليقًا...

source: Read more
ar: قراءة المزيد

source: Show less
ar: عرض أقل

source: Search medicine
ar: ابحث عن دواء

# medicine_example
source: e.g. Vitamin D
ar: مثال: فيتامين د

source: Twice Daily
ar: مرتين يوميًا

source: Three Times Daily
ar: ثلاث مرات يوميًا

source: Medicine saved successfully
ar: تم حفظ الدواء بنجاح

# no_medicine_today
source: No medicine for today
ar: لا توجد أدوية اليوم

# minute
source: MIN
ar: الدقيقة

source: What is your complaint?
ar: ما هي شكواك؟

# greeting
source: Good Evening, {name}
ar: مساء الخير، {name}

# health_matters
source: Your health matters
ar: صحتك تهمنا

source: Reply
ar: رد

# write_reply
source: Write a reply...
ar: اكتب ردًا...

source: Send
ar: إرسال

# chat_bot_title
source: As'alny
ar: اسألني

source: Type your message...
ar: اكتب رسالتك...

# ai_typing
source: AI is typing...
ar: الذكاء الاصطناعي يكتب...

# search_doctor_specialty
source: Search doctor or specialty
ar: ابحث عن طبيب أو تخصص

source: About Doctor
ar: عن الطبيب

source: Book Now
ar: احجز الآن

source: Book Consultation
ar: حجز استشارة

# describe_complaint
source: Describe your complaint
ar: اشرح شكواك

# write_complaint_hint
source: Write your symptoms or problem here...
ar: اكتب الأعراض أو المشكلة هنا...

source: Consultation Price
ar: سعر الاستشارة

# proceed_payment
source: Proceed to Payment
ar: المتابعة للدفع

# write_symptoms_hint
source: Write your symptoms or problem here...
ar: اكتب الأعراض أو المشكلة التي تعاني منها هنا...

source: Proceed to Payment
ar: المتابعة إلى الدفع

source: Blood Test
ar: تحليل الدم

source: Sugar Analysis
ar: تحليل السكر

source: Cholesterol Test
ar: تحليل الكوليسترول

source: Chest X-Ray
ar: أشعة على الصدر

source: MRI Scan
ar: تصوير بالرنين المغناطيسي

source: Condition
ar: الحالة المرضية

source: Diabetes
ar: مرض السكري

source: High blood pressure
ar: ارتفاع ضغط الدم

source: Chronic back pain
ar: آلام الظهر المزمنة

source: Choose language
ar: اختر اللغة

# intro_title
source: Your health in one app
ar: صحتك في تطبيق واحد

# intro_description
source: Axon helps you manage your health with ease. Book doctors, track your medications, connect with specialists, and stay reassured.
ar: Axon يساعدك على إدارة صحتك بسهولة. احجز دكاترة، تابع أدويتك، تواصل مع المختصين، وخليك دايمًا مطمئن.

source: Home
ar: الصفحة الرئيسية

# create_password
source: Create a strong password
ar: أنشئ كلمة مرور قوية

# agree_terms
source: I agree to the meddidoc Terms of Service and Privacy Policy
ar: أوافق على شروط الخدمة وسياسة الخصوصية الخاصة بـ MeddiDoc

# im_patient
source: I’m a Patient
ar: أنا مريض

# patient_desc
source: Find doctors and book appointments
ar: ابحث عن الأطباء واحجز المواعيد

# im_doctor
source: I’m a Doctor
ar: أنا طبيب

# doctor_desc
source: Manage patients and consultations
ar: إدارة المرضى والاستشارات

# forgot_password_title
source: Forgot Password
ar: نسيت كلمة المرور

# forgot_password_desc
source: Enter your email to receive a verification code
ar: أدخل بريدك الإلكتروني لاستلام رمز التحقق

source: Send Code
ar: إرسال الرمز

source: Verification Code
ar: رمز التحقق

# verification_code_desc
source: Enter the 4-digit code sent to your email address
ar: أدخل الرمز المكون من 4 أرقام المرسل إلى بريدك الإلكتروني

source: OTP Code
ar: رمز التحقق

source: Verify
ar: تحقق

source: Resend Code
ar: إعادة إرسال الرمز

source: Create New Password
ar: إنشاء كلمة مرور جديدة

source: Reset Password
ar: إعادة تعيين كلمة المرور

source: Doctor Registration
ar: تسجيل الطبيب

# create_professional_account
source: Create your professional account
ar: أنشئ حسابك المهني

source: Specialization
ar: التخصص

source: Select Specialization
ar: اختر التخصص

source: Cardiology
ar: أمراض القلب

source: Neurology
ar: أمراض المخ والأعصاب

source: Pediatrics
ar: طب الأطفال

source: Dentistry
ar: طب الأسنان

# years_experience
source: Years of Experience
ar: سنوات الخبرة

# enter_years_experience
source: Enter number years of experience
ar: أدخل عدد سنوات الخبرة

source: Medical License Number
ar: رقم الترخيص الطبي

source: About
ar: نبذة

# about_hint
source: Tell us about your experience and background
ar: حدثنا عن خبرتك وخلفيتك المهنية

source: Session Price
ar: سعر الجلسة

source: Enter session price
ar: أدخل سعر الجلسة

source: Upload Medical License
ar: رفع الترخيص الطبي

# drag_upload
source: Drag or Click to upload attachment
ar: اسحب أو اضغط لرفع الملف

# max_file_size
source: Max File size : 2mb
ar: الحد الأقصى لحجم الملف: 2 ميجا

source: Create Account
ar: إنشاء حساب

# already_have_account
source: Already have an account?
ar: لديك حساب بالفعل؟

source: Login
ar: تسجيل الدخول

source: Medical Profile
ar: الملف الطبي

# medical_profile_desc
source: Help us understand your health better
ar: ساعدنا على فهم حالتك الصحية بشكل أفضل

source: Blood Type
ar: فصيلة الدم

source: Select Blood Type
ar: اختر فصيلة الدم

# height
source: Height (cm)
ar: الطول (سم)

# weight
source: Weight (kg)
ar: الوزن (كجم)

# medical_info_hint
source: Your medical information helps doctors provide better care.
ar: معلوماتك الطبية تساعد الأطباء على تقديم رعاية أفضل.

source: Health Conditions
ar: الحالات الصحية

# add_health_conditions
source: Add your health conditions
ar: أضف الحالات الصحية

# enter_condition
source: Enter condition name
ar: أدخل اسم الحالة

source: Allergies
ar: الحساسية

# add_allergies
source: Add your allergies
ar: أضف أنواع الحساسية

# enter_allergy
source: Enter allergy name
ar: أدخل اسم الحساسية

source: Radiology
ar: الأشعة

# upload_radiology
source: Upload your radiology images
ar: ارفع صور الأشعة

source: Description
ar: الوصف

# enter_scan_type
source: Enter the type of medical scan
ar: أدخل نوع الفحص الطبي

source: Remove
ar: حذف

source: Lab Tests
ar: التحاليل

# upload_lab_tests
source: Upload your medical lab tests
ar: ارفع التحاليل الطبية

source: Finish
ar: إنهاء

# account_created
source: Account Created Successfully 🎉
ar: تم إنشاء الحساب بنجاح 🎉

# redirecting_home
source: Welcome! Redirecting to home...
ar: مرحبًا! يتم التحويل إلى الصفحة الرئيسية...

source: Good Evening
ar: مساء الخير

source: Your health matters
ar: صحتك تهمنا

source: Today’s Medications
ar: أدوية اليوم

# next_dose_in
source: Next dose in {minutes} minutes
ar: الجرعة القادمة خلال {minutes} دقيقة

source: Next dose
ar: الجرعة القادمة

source: taken today
ar: تم أخذها اليوم

source: Time
ar: الوقت

source: Taken
ar: تم

source: View All
ar: عرض الكل

source: Quick Actions
ar: إجراءات سريعة

source: Doctors
ar: الأطباء

source: Hospitals
ar: المستشفيات

source: Medicine
ar: الأدوية

source: As'aly
ar: اسألني

source: Articles & Tips
ar: مقالات ونصائح

source: My Doctors
ar: أطبائي

source: Cardiology Specialist
ar: أخصائي قلب

source: Neurology Consultant
ar: استشاري مخ وأعصاب

source: Internal Medicine
ar: باطنة

source: Chat
ar: محادثة

source: Community
ar: المجتمع

# no_posts
source: No posts yet
ar: لا توجد منشورات بعد

# be_first_post
source: Be the first to share something
ar: كن أول من يشارك شيئًا

source: Create Post
ar: إنشاء منشور

source: Post title
ar: عنوان المنشور

source: Write something...
ar: اكتب شيئًا...

source: Add Image
ar: إضافة صورة

source: Share
ar: نشر

# edit_basic_info
source: Edit Basic Information
ar: تعديل البيانات الأساسية

source: Edit Health Conditions
ar: تعديل الحالات الصحية

source: Edit Allergies
ar: تعديل الحساسية

source: Edit Radiology
ar: تعديل الأشعة

source: Edit Lab Tests
ar: تعديل التحاليل

source: Change Password
ar: تغيير كلمة المرور

source: Notification Settings
ar: إعدادات الإشعارات

source: Logout
ar: تسجيل الخروج

source: Delete Account
ar: حذف الحساب

source: Basic Information
ar: البيانات الأساسية

source: Personal & medical info
ar: البيانات الشخصية والطبية

source: Phone
ar: رقم الهاتف

source: Edit
ar: تعديل

source: Your health conditions
ar: حالاتك الصحية

# no_health_conditions
source: No health conditions added yet
ar: لم تتم إضافة أي حالات صحية بعد

# tap_edit_add
source: Tap Edit to add one
ar: اضغط على تعديل لإضافة حالة

source: Your allergies
ar: أنواع الحساسية

source: Medical lab tests
ar: التحاليل الطبية

source: Current Password
ar: كلمة المرور الحالية

source: Enter current password
ar: أدخل كلمة المرور الحالية

source: New Password
ar: كلمة المرور الجديدة

source: Enter new password
ar: أدخل كلمة المرور الجديدة

source: Confirm New Password
ar: تأكيد كلمة المرور الجديدة

source: Update Password
ar: تحديث كلمة المرور

# logout_confirm
source: Are you sure you want to logout?
ar: هل أنت متأكد أنك تريد تسجيل الخروج؟

source: Cancel
ar: إلغاء

# delete_account_confirm
source: This action is permanent and cannot be undone.
ar: هذا الإجراء نهائي ولا يمكن التراجع عنه.

source: Delete
ar: حذف

source: All Medicine
ar: كل الأدوية

source: Once Daily
ar: مرة يوميًا

# next_at
source: Next: {time}
ar: الجرعة القادمة: {time}

source: All
ar: الكل

source: Heart
ar: القلب

source: Internal
ar: باطنة

source: Kidney
ar: كلى

source: Bones
ar: عظام

source: Neuro
ar: أعصاب

source: Psychology
ar: نفسي

source: More
ar: المزيد

source: {price} EGP
ar: {price} جنيه

source: Add New Medicine
ar: إضافة دواء جديد

source: Medicine Name
ar: اسم الدواء

# medicine_name_hint
source: ex: Vitamin D
ar: مثال: فيتامين د

source: Frequency
ar: الجرعة

source: Intake Time
ar: وقت التناول

source: HOUR
ar: ساعة

source: MIN
ar: دقيقة

source: AM
ar: صباحًا

source: PM
ar: مساءً

source: Duration
ar: المدة

source: Start Date
ar: تاريخ البداية

source: End Date
ar: تاريخ النهاية

source: Tap to select
ar: اضغط للاختيار

source: SAVE
ar: حفظ

# ai_intro
source: Hi, I’m your AI medical assistant. Ask me anything about your health.
ar: مرحبًا، أنا المساعد الطبي الذكي 🤖 اسألني أي شيء عن صحتك.

# assistant_unavailable
source: The assistant is temporarily unavailable. Please try again in a moment.
ar: المساعد غير متاح مؤقتًا. يرجى المحاولة مرة أخرى لاحقًا.

# type_message
source: Type your message...
ar: اكتب رسالتك...

# hi_doctor
source: Hi, Dr {name}
ar: مرحبًا دكتور {name}

# manage_patients
source: Manage your patients easily
ar: إدارة مرضاك بسهولة

source: Chats
ar: المحادثات

source: Requests
ar: الطلبات

# back_pain_spinal
source: Back pain and spinal
ar: آلام الظهر والعمود الفقري

source: Chronic neck pain
ar: آلام مزمنة في الرقبة

source: Lower back stiffness
ar: تيبس أسفل الظهر

# shoulder_pain_injury
source: Shoulder pain after injury
ar: ألم في الكتف بعد الإصابة

source: Spinal nerve irritation
ar: تهيج أعصاب العمود الفقري

# chest_pain_short_breath
source: Chest pain and short breath
ar: ألم في الصدر وضيق في التنفس

source: Reject
ar: رفض

source: Accept
ar: قبول

source: Articles
ar: المقالات

source: Create Article
ar: إنشاء مقال

source: Enter title
ar: أدخل العنوان

source: Enter content
ar: أدخل المحتوى

# no_articles
source: No articles yet
ar: لا توجد مقالات بعد

source: Patient Reviews
ar: تقييمات المرضى

# review_professional
source: Doctor was very professional and helpful.
ar: كان الطبيب محترفًا ومتعاونًا للغاية.

# review_excellent
source: Excellent experience, highly recommended.
ar: تجربة ممتازة وأنصح بها بشدة.

# review_good_wait
source: Good doctor but waiting time was long.
ar: طبيب جيد ولكن وقت الانتظار كان طويلًا.

source: Edit Profile
ar: تعديل الملف الشخصي

source: Neurologist
ar: أخصائي مخ وأعصاب

source: License Number
ar: رقم الترخيص

source: Medical License
ar: الترخيص الطبي

# experienced_neurologist
source: Experienced neurologist with a strong background in patient care
ar: طبيب مخ وأعصاب ذو خبرة وخلفية قوية في رعاية المرضى

source: Price
ar: السعر

source: Hello doctor
ar: مرحبًا دكتور

# how_can_help
source: How can I help you?
ar: كيف يمكنني مساعدتك؟

# field_required
source: This field is required
ar: هذا الحقل مطلوب

# email_required
source: Email is required
ar: البريد الإلكتروني مطلوب

# invalid_email
source: Invalid email address
ar: بريد إلكتروني غير صالح

# password_required
source: Password is required
ar: كلمة المرور مطلوبة

# password_min
source: Password must be at least 6 characters
ar: يجب أن تكون كلمة المرور 6 أحرف على الأقل

# confirm_password_required
source: Confirm password is required
ar: تأكيد كلمة المرور مطلوب

# passwords_not_match
source: Passwords do not match
ar: كلمتا المرور غير متطابقتين

# title_required
source: Title is required
ar: العنوان مطلوب

# title_min
source: Title must be at least 3 characters
ar: يجب أن يكون العنوان 3 أحرف على الأقل

# description_required
source: Description is required
ar: الوصف مطلوب

# description_min
source: Description must be at least 10 characters
ar: يجب أن يكون الوصف 10 أحرف على الأقل

# description_max
source: Description must not exceed 300 characters
ar: يجب ألا يزيد الوصف عن 300 حرف

# date_required
source: Event date is required
ar: تاريخ الحدث مطلوب

# date_past
source: Date cannot be in the past
ar: لا يمكن أن يكون التاريخ في الماضي

# time_required
source: Event time is required
ar: وقت الحدث مطلوب

# date_time_required
source: Date & Time Event are required
ar: تاريخ ووقت الحدث مطلوبان

source: No Events Found
ar: لا توجد فعاليات
